# 1.1.2
# Напишите и запустите программу. которая выводит строку  "Hello world!"

print('Hello world!')

# 1.1.3
# Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"

user_name = input()
print(f'Hello {user_name}!')

# 1.2.1
# Напишите программу, чтобы вывести:
# *********
# *       *
# *       *
# *********

print('*' * 9)
print('*' + ' ' * 7 + '*')
print('*', ' ' * 5, '*')
print('*' * 9)